# ********************< 正则表达式 >********************

\          echo "\\" | grep '\\'                          # 
^          echo "12345678" | grep '^1234'                 # 匹配行首
$          echo "12345678" | grep '5678$'                 # 匹配行尾
.          echo "12345678" | grep '.*'                    # 匹配任意字符
*          echo "12345678" | grep '[0-9]*'                # 匹配零或多次前一字符
+          echo "12345678" | grep '[0-9]\+'               # 匹配一或多次前一字符
?          echo "12345678" | grep '1234567[0-9]\?'        # 匹配零或一次前一字符
{n}        echo "12345678" | grep '[0-9]\{8\}'            # 匹配前一字符n次
{n,}       echo "12345678" | grep '[0-9]\{6,\}'           # 匹配前一字符至少n次
{n,m}      echo "12345678" | grep '[0-9]\{6,9\}'          # 匹配前一字符n到m次
|          echo "12345678" | grep '1234\(5\|6\)678'       # 
[]         echo "12345678" | grep '[012345678]\+'         # 匹配集合中任意字符
[-]        echo "12345678" | grep '[0-9]\+'               # 匹配集合范围中任意字符
[^]        echo "12345678" | grep '[^9a-zA-Z]\+'          # 匹配不属于集合中任意字符
[|]        echo "12345678" | grep '[^9a-zA-Z]\+'          # 匹配2

# ********************< 常见正则表达式 >********************
[<.*>.*<\/.*>|<.* \/>]