# ********************< 赋值运算 >********************
count=1  # 等号前后无空格

# ********************< 四则运算(加 减 乘 除 模) >********************
a=1
b=2
# 第一种方法(运算符前后无空格)
let c=a+b | let c=$a+$b
# 第二种方法(运算符前后可空格)
c=$[a + b] | c=$[$a + $b]
# 第三种方法(运算符前后可空格)
c=$((a + b)) | c=$(($a + $b))
# 第四种方法(运算符前后可空格)
c=`expr $a + $b`
# 第五种方法(运算符前后可空格)
c=$(expr $a + $b)

# ``和$()等效
echo `ll | wc -l`
echo $(ll | wc -l)

# ********************< 自加 自减 >********************
# ++ --
let a++
$[++a]
$((++a))
# += -=
let a+=2
$[a += 2]
$((a += 2))

# ********************< 浮点数运算 >********************
# 第一种方法(bc)
$(echo "scale=2; $a / $b" | bc)
# 第二种方法(awk)
$(awk 'BEGIN {print '$a' / '$b'}')
$(awk 'BEGIN {printf "%.2f\n", '$a' / '$b'}')

# ********************< 百分数(50.00%) >********************
$(awk 'BEGIN {printf "%.2f%\n", '$a' / '$b' *100}')